function parseLyric(lrc) {
      var lyrics = lrc.split("\n");
      var lrcObj = {};
      for(var i=0;i<lyrics.length;i++){
          var lyric = decodeURIComponent(lyrics[i]);
          var timeReg = /\[\d*:\d*((\.|\:)\d*)*\]/g;
          var timeRegExpArr = lyric.match(timeReg);
          if(!timeRegExpArr)continue;
          var clause = lyric.replace(timeReg,'');
          for(var k = 0,h = timeRegExpArr.length;k < h;k++) {
              var t = timeRegExpArr[k];
              var min = Number(String(t.match(/\[\d*/i)).slice(1)), sec = Number(String(t.match(/\:\d*/i)).slice(1));
              var time = min * 60 + sec;
              lrcObj[time] = clause;
          }
      }
      return lrcObj;
  }

var musicLrc = {};





Page({
  onLoad:function(){
    var that=this;
        wx.getSystemInfo({
      success: function(res) {
        that.setData({
          scrollH:res.windowHeight - 160,
          scrollHall:res.windowHeight
        })
      }
    })

  
  },

  onReady: function (e) {
    // 使用 wx.createAudioContext 获取 audio 上下文 context
    this.audioCtx = wx.createAudioContext('myAudio')
  },
  data: {
   percent:0,
    scrollH:0,
    scrollHall:0,
  music:{
      id:1,
      posit:'http://www.liuhedong.online/music/1.jpg',
      name:'Gentleman',
      author:'鸟叔',
      src:'http://www.liuhedong.online/music/1.mp3',
      des:'朴载相（Psy），1977年12月31日出生于韩国首尔，韩国歌手。',
      lrc:`
[00:00.73]Gentleman
[00:05.85]Psy
[00:07.85]
[00:14.53]알랑가몰라 왜 화끈해야
[00:17.25]하는건지
[00:18.30]알랑가몰라 왜 말끔해야
[00:20.93]하는건지
[00:21.87]알랑가몰라 아리까리하면 까리해
[00:25.81]알랑가몰라 We Like We We
[00:28.18]We Like Party 해
[00:29.50]있잖아 말이야
[00:31.39]이사람으로 말씀드리자면 말이야
[00:35.23]용기 패기 똘끼 멋쟁이 말이야
[00:38.70]너가 듣고픈말 하고픈게
[00:41.05]난데 말이야
[00:42.58]Damn Girl You so freakin sexy
[00:45.73]
[00:53.55]Ah Ah Ah Ah I’m a
[00:55.30]Ah Ah Ah Ah I’m a
[00:57.22]Ah Ah Ah Ah I’m a mother
[00:59.62]father gentleman
[01:02.42]I’m a Ah I’m a
[01:06.48]I’m a mother father gentleman
[01:09.51]I’m a Ah I’m a
[01:13.39]I’m a mother father gentleman
[01:17.38]알랑가몰라 왜 미끈해야
[01:20.06]하는건지
[01:20.97]알랑가몰라 왜 쌔끈해야 하는건지
[01:24.75]알랑가몰라 달링 빨리와서 난리해
[01:28.64]알랑가몰라 난리난리 났어 빨리해
[01:32.48]있잖아 말이야
[01:33.94]너의 머리 허리 다리 종아리 말이야
[01:37.72]Good feeling feeling Good
[01:39.67]부드럽게 말이야
[01:41.51]아주 그냥 헉소리나게 악소리
[01:43.74]나게 말이야
[01:45.37]Damn Girl I’m a party mafia
[01:48.67]
[01:56.18]Ah Ah Ah Ah I’m a
[01:58.28]Ah Ah Ah Ah I’m a
[02:00.07]Ah Ah Ah Ah I’m a mother father
[02:02.89]gentleman
[02:05.29]I’m a Ah I’m a
[02:08.67]I’m a mother father gentleman
[02:12.88]I’m a Ah I’m a
[02:16.40]I’m a mother father gentleman
[02:19.21]Gonna make you sweat
[02:20.95]Gonna make you wet
[02:23.12]You know who I am Wet PSY
[02:26.85]Gonna make you sweat
[02:28.83]Gonna make you wet
[02:30.79]You know who I am Wet PSY
[02:33.93]Wet PSY Wet PSY Wet PSY
[02:36.76]PSY PSY PSY
[02:38.18]Ah I’m a mother father gentleman
[02:43.34]I’m a Ah I’m a
[02:47.10]I’m a mother father gentleman
[02:50.89]I’m a Ah I’m a
[02:54.62]I’m a mother father gentleman
[02:57.23]
[03:02.97]Mother father gentleman
[03:04.89]
[03:10.56]Mother father gentleman
[03:12.60]
`

  },
    musicList:[

      {
      id:1,
      posit:'http://www.liuhedong.online/music/1.jpg',
      name:'Gentleman',
      author:'鸟叔',
      src:'http://www.liuhedong.online/music/1.mp3',
      des:'朴载相（Psy），1977年12月31日出生于韩国首尔，韩国歌手。',
      lrc:`
[00:00.73]Gentleman
[00:05.85]Psy
[00:07.85]
[00:14.53]알랑가몰라 왜 화끈해야
[00:17.25]하는건지
[00:18.30]알랑가몰라 왜 말끔해야
[00:20.93]하는건지
[00:21.87]알랑가몰라 아리까리하면 까리해
[00:25.81]알랑가몰라 We Like We We
[00:28.18]We Like Party 해
[00:29.50]있잖아 말이야
[00:31.39]이사람으로 말씀드리자면 말이야
[00:35.23]용기 패기 똘끼 멋쟁이 말이야
[00:38.70]너가 듣고픈말 하고픈게
[00:41.05]난데 말이야
[00:42.58]Damn Girl You so freakin sexy
[00:45.73]
[00:53.55]Ah Ah Ah Ah I’m a
[00:55.30]Ah Ah Ah Ah I’m a
[00:57.22]Ah Ah Ah Ah I’m a mother
[00:59.62]father gentleman
[01:02.42]I’m a Ah I’m a
[01:06.48]I’m a mother father gentleman
[01:09.51]I’m a Ah I’m a
[01:13.39]I’m a mother father gentleman
[01:17.38]알랑가몰라 왜 미끈해야
[01:20.06]하는건지
[01:20.97]알랑가몰라 왜 쌔끈해야 하는건지
[01:24.75]알랑가몰라 달링 빨리와서 난리해
[01:28.64]알랑가몰라 난리난리 났어 빨리해
[01:32.48]있잖아 말이야
[01:33.94]너의 머리 허리 다리 종아리 말이야
[01:37.72]Good feeling feeling Good
[01:39.67]부드럽게 말이야
[01:41.51]아주 그냥 헉소리나게 악소리
[01:43.74]나게 말이야
[01:45.37]Damn Girl I’m a party mafia
[01:48.67]
[01:56.18]Ah Ah Ah Ah I’m a
[01:58.28]Ah Ah Ah Ah I’m a
[02:00.07]Ah Ah Ah Ah I’m a mother father
[02:02.89]gentleman
[02:05.29]I’m a Ah I’m a
[02:08.67]I’m a mother father gentleman
[02:12.88]I’m a Ah I’m a
[02:16.40]I’m a mother father gentleman
[02:19.21]Gonna make you sweat
[02:20.95]Gonna make you wet
[02:23.12]You know who I am Wet PSY
[02:26.85]Gonna make you sweat
[02:28.83]Gonna make you wet
[02:30.79]You know who I am Wet PSY
[02:33.93]Wet PSY Wet PSY Wet PSY
[02:36.76]PSY PSY PSY
[02:38.18]Ah I’m a mother father gentleman
[02:43.34]I’m a Ah I’m a
[02:47.10]I’m a mother father gentleman
[02:50.89]I’m a Ah I’m a
[02:54.62]I’m a mother father gentleman
[02:57.23]
[03:02.97]Mother father gentleman
[03:04.89]
[03:10.56]Mother father gentleman
[03:12.60]
`
      },
      {
      id:2,
      posit:'http://www.liuhedong.online/music/2.jpg',
      name:'两个人',
      author:'蔡妍',
      src:'http://www.liuhedong.online/music/2.mp3',
      des:'蔡妍（이채연），1978年12月6日出生于韩国首尔，韩国流行歌手',
        lrc:`
[00:12.50]나 나나나 난난나나나나
[00:17.23]나 나나나 난난나나나나
[00:22.24]나를 보고있어 다가오고 있어看着我 走进我
[00:24.03] 네가 보낸 눈빛에 끌려 你被我的眼神吸引住
[00:26.23]나를 보고있어 빠져들고 있어 看着我 沉浸在我的记忆中
[00:29.20]네가 거는 최면에 취해 你惹上了我的催眠术
[00:31.25]오늘 너를 갖겠어 今天我选择了你
[00:33.42]나를 한번 안아봐 拥抱我吧
[00:35.87]나의 외로운 맘 니 가슴에 모두 맡길게 会把我孤独的心 全部都托付给你
[00:41.18]조급히 서두르지마不要着急
[00:43.57] 좀 더 멋지게 다가와 要潇洒地走进我
[00:46.52]가슴이 뜨거운 사랑 这个热情奔放的爱情
[00:48.43]이 밤 너와 함께 느끼고파 我想和你一起度过今晚
[00:51.46]사랑의 노래를 불러给我唱支情歌
[00:53.24] 너와 나 하나가 되어 我已与你成了一体
[00:55.77]멈출 수 없는 그 춤을 跳着无法停止的那支舞
[00:58.03]이 밤 너와 함께 추고싶어 这个夜晚想跟你一起跳舞
[01:00.87]나 나나나 난난나나나나
[01:05.33] 내가 네게 줄 수 있는可以给你爱
[01:07.91] 사랑을 너에게 줄게 我都会给你
[01:10.72]나 나나나 난난나나나나
[01:14.89]거침없는 너의 사랑你永不停止的爱情
[01:17.35] 너와 나 단 둘이서 只想和你我二人分享
[01:38.88]나를 보고있어 미소 짓고있어看着我 微笑着
[01:41.17] 니가 내게 다가올 때까지我会等待着你走近我
[01:42.96]손짓 하고있어 내게 오고있어 向我招手 走向我
[01:46.05]니가 보는 눈빛에 끌려 你被我的眼神吸引住
[01:47.87]오늘 너를 택했어 今天我选择了你
[01:50.18]나를 한번 안아봐 拥抱我吧
[01:52.74]나의 외로운 맘 니 가슴에 모두 맡길게 会把我孤独的心 全部都托付给你
[01:57.75]조급히 서두르지마 不要着急
[01:59.40]좀 더 멋지게 다가와 要潇洒地走进我
[02:03.55]가슴이 뜨거운 사랑 这个热情奔放的爱情
[02:05.40]이 밤 너와 함께 느끼고파 我想和你一起度过今晚
[02:07.15]사랑의 노래를 불러给我唱支情歌
[02:10.06] 너와 나 하나가 되어 我已与你成了一体
[02:12.80]멈출수 없는 그 춤을 跳着无法停止的那支舞
[02:15.40]이 밤 너와 함께 추고싶어 这个夜晚想跟你一起跳舞
[02:17.56]나 나나나 난난나나나나
[02:22.36]내가 네게 줄 수 있는 可以给你爱
[02:24.42]사랑을 너에게 줄게 我都会给你
[02:26.94]나 나나나 난난나나나나
[02:31.67]거침없는 너의 사랑 你永不停止的爱情
[02:34.02]너와 나 단 둘이서 只想和你我二人分享
[02:55.66]나 나나나 난난나나나나


`
      },
      {
      id:3,
      posit:'http://www.liuhedong.online/music/3.jpg',
      name:'危险演出',
      author:'蔡妍',
      src:'http://www.liuhedong.online/music/3.mp3',
      des:'蔡妍（이채연）2003年，蔡妍于推出首张专辑《Its My Time》',
        lrc:`[ti:危险的演出]
[ar:蔡妍]
[al:]
[00:02.64]危险的演出
[00:05.27]演唱：蔡妍
[00:08.76]
[00:37.05]난 몰랐었어 난 궁굼했어
[00:40.57]니 핸드폰에 찍힌 여자전화번호
[00:44.20]너 없을 때 난 걸어봤었지
[00:47.87]너와 어떤 관계인지 난 알고 싶어
[00:51.34]난 몰랐었어 기가 막혔어
[00:54.73]나보고 되레 누구냐며 물어봤지
[00:58.51]애인이라며 년 됐다며
[01:01.99]언제부터 널 만났냐며 다그쳤지
[01:06.25]한참을 멍하니 움직일수 없었어
[01:13.28]너를 믿었는데 사랑했었는데
[01:16.82]너는 사랑갖고 장난쳤니
[01:22.31]이젠 널 잊을래 이젠 널 떠날래
[01:25.82]너무도 화가나 울 수 조차 없어
[01:29.34]너의 그 변명도 너의 그 거짓도
[01:32.89]너무나 완벽해 배우보다 더
[01:36.57]니가 연출하고 니가 주인공한
[01:40.06]그런 드라마에 난 출연 안할래
[01:43.61]이젠 나를 빼줘
[01:45.44]이젠 날 잊어줘 내가 널 편하게 떠나줄테니
[01:51.50]라라랄 라라라랄 라라라라 그래도 추억으로 남겠지
[01:58.64]라라랄 라라라랄 라라라라 고마워 좋은 경험이였어
[02:05.58]
[02:21.00]넌 완벽했어 넌 성곡했어
[02:24.37]그 여자에게 했던 말들과 똑같이
[02:28.06]입술이 예뻐 눈매가 예뻐
[02:31.52]매력이 넘친다며 넌 다가왔고
[02:35.10]똑같은 선물 똑같은 메일
[02:38.66]매일매일 넌 똑같은 문장 날리고
[02:42.31]재밌어 하며 즐거워 하며
[02:45.84]두 여자 사이에서 넌 우쭐했겠지
[02:50.40]한참을 멍하니 움직일수 없었어
[02:57.16]너를 믿었는데 사랑했었는데
[03:00.70]너는 사랑갖고 장난쳤니
[03:06.19]이젠 널 잊을래 이젠 널 떠날래
[03:09.67]너무도 화가나 울 수 조차 없어
[03:13.22]너의 그 변명도 너의 그 거짓도
[03:16.78]너무나 완벽해 배우보다 더
[03:20.44]니가 연출하고 니가 주인공한
[03:23.96]그런 드라마에 난 출연 안할래
[03:27.53]이젠 나를 빼줘
[03:29.26]이젠 날 잊어줘 내가 널 편하게 떠나줄테니
[03:35.43]라라랄 라라라랄 라라라라 그래도 추억으로 남겠지
[03:42.53]라라랄 라라라랄 라라라라 고마워 좋은 경험이였어
[03:49.90]
`
      },
      {
      id:4,
      posit:'http://www.liuhedong.online/music/4.jpg',
      name:'认真的雪',
      author:'薛之谦',
      src:'http://www.liuhedong.online/music/4.mp3',
      des:'薛之谦（Joker Xue），1983年7月17日出生于上海，华语流行乐男歌手、影视演员。',
        lrc:`[ti:认真的雪]
[ar:薛之谦]
[al:认真的雪]
[00:00.95]认真的雪
[00:01.20]演唱：薛之谦
[00:01.48]
[00:02.24]雪下地那么深 下得那么认真
[00:07.49]倒映出我躺在雪中的伤痕
[00:11.44]
[00:24.95]夜深人静 那是爱情
[00:34.24]偷偷地控制着我的心
[00:37.22]提醒我 爱你要随时待命
[00:41.21]
[00:43.42]音乐安静 还是爱情啊
[00:52.36]一步一步吞噬着我的心
[00:55.70]爱上你 我失去了我自己
[01:00.12]
[01:01.37]爱得那么认真 爱得那么认真
[01:06.80]可还是听见了你说不可能
[01:10.81]已经十几年没下雪的上海 
[01:14.21]突然飘雪
[01:16.01]就在你说了分手的瞬间
[01:19.71]雪下得那么深 下得那么认真
[01:25.08]倒映出我躺在雪中的伤痕
[01:29.66]我并不在乎自己
[01:31.58]究竟多伤痕累累
[01:34.27]可我在乎今后你有谁陪
[01:39.04]
[02:05.69]音乐安静 还是爱情啊
[02:14.57]一步一步吞噬着我的心
[02:17.86]爱上你 我失去了我自己
[02:22.53]
[02:23.64]爱得那么认真 爱得那么认真
[02:29.06]可还是听见了你说不可能
[02:33.08]已经十几年没下雪的上海 
[02:36.49]突然飘雪
[02:38.26]就在你说了分手的瞬间
[02:41.97]雪下得那么深 下得那么认真
[02:47.36]倒映出我躺在雪中的伤痕
[02:51.94]我并不在乎自己
[02:53.81]究竟多伤痕累累
[02:56.59]可我在乎今后你有谁陪
[03:01.64]
[03:02.69]爱得那么深 爱得那么认真
[03:07.98]可还是听见了你说不可能
[03:11.93]已经十几年没下雪的上海 
[03:15.30]突然飘雪
[03:17.13]就在你说了分手的瞬间
[03:20.68]雪下得那么深 下得那么认真
[03:26.20]倒映出我躺在雪中的伤痕
[03:30.79]我并不在乎自己
[03:32.69]究竟多伤痕累累
[03:35.41]可我在乎今后你有谁陪
[03:40.28]
[03:41.74]爱得那么深 比谁都认真
[03:46.68]可最后还是只剩我一个人
[03:51.31]漫天风雪请别再把我的眼泪擦去
[03:56.05]毕竟那是我最爱的女人
[04:01.33]毕竟我曾是她深爱的人
[04:11.46]
`
      },
      {
      id:5,
      posit:'http://www.liuhedong.online/music/5.jpg',
      name:'演员',
      author:'薛之谦',
      src:'http://www.liuhedong.online/music/5.mp3',
      des:'薛之谦（Joker Xue），2005年，因参加选秀节目《我型我秀》而正式出道',
        lrc:`[00:00.32]演员
[00:01.00]
[00:01.61]作词：薛之谦
[00:02.64]作曲：薛之谦
[00:03.00]演唱：薛之谦
[00:04.20]
[00:21.12]简单点说话的方式简单点
[00:30.20]递进的情绪请省略
[00:33.64]你又不是个演员
[00:36.38]别设计那些情节
[00:39.36]
[00:41.93]没意见我只想看看你怎么圆
[00:51.54]你难过的太表面 像没天赋的演员
[00:57.15]观众一眼能看见
[01:00.19]
[01:02.22]该配合你演出的我演视而不见
[01:07.68]在逼一个最爱你的人即兴表演
[01:12.90]什么时候我们开始收起了底线
[01:18.02]顺应时代的改变看那些拙劣的表演
[01:23.42]可你曾经那么爱我干嘛演出细节
[01:28.63]我该变成什么样子才能延缓厌倦
[01:33.87]原来当爱放下防备后的这些那些
[01:39.37]才是考验
[01:41.97]
[01:44.60]没意见你想怎样我都随便
[01:54.53]你演技也有限
[01:57.58]又不用说感言
[02:00.15]分开就平淡些
[02:02.99]
[02:05.00]该配合你演出的我演视而不见
[02:10.53]别逼一个最爱你的人即兴表演
[02:15.81]什么时候我们开始没有了底线
[02:21.01]顺着别人的谎言被动就不显得可怜
[02:26.43]可你曾经那么爱我干嘛演出细节
[02:31.52]我该变成什么样子才能配合出演
[02:36.72]原来当爱放下防备后的这些那些
[02:41.86]都有个期限
[02:44.60]
[02:47.56]其实台下的观众就我一个
[02:53.04]其实我也看出你有点不舍
[02:58.34]场景也习惯我们来回拉扯
[03:02.93]还计较着什么
[03:07.39]
[03:08.71]其实说分不开的也不见得
[03:14.04]其实感情最怕的就是拖着
[03:19.21]越演到重场戏越哭不出了
[03:24.07]是否还值得
[03:28.12]
[03:29.07]该配合你演出的我尽力在表演
[03:34.39]像情感节目里的嘉宾任人挑选
[03:39.68]如果还能看出我有爱你的那面
[03:44.82]请剪掉那些情节让我看上去体面
[03:50.04]可你曾经那么爱我干嘛演出细节
[03:55.31]不在意的样子是我最后的表演
[04:01.05]是因为爱你我才选择表演 这种成全`
      },
      {
      id:6,
      posit:'http://www.liuhedong.online/music/6.jpg',
      name:'别把疼你的人弄丢了',
      author:'雨宗林',
      src:'http://www.liuhedong.online/music/6.mp3',
      des:'雨天，中国内地男歌手。2007年被授予广东流行音乐学会会员称号',
        lrc:`[ti:别把疼你的人弄丢了] 
[ar:雨宗林 ] 
[al:] 
[by:果果1314] 

[00:00.00]雨宗林 - 别把疼你的人弄丢了
[00:04.00]词：雨宗林
[00:07.00]曲：雨宗林
[00:10.00]编曲：顾雄
[00:13.00]歌词编辑：果果
[00:16.00]QQ:765708831
[00:19.00]歌词搜索：www.lrc99.com
[00:22.00]
[00:31.15]总是不愿意面对
[00:34.87]倔强错误的自己
[00:38.68]始终徘徊在自我的世界
[00:42.17]你是否想过她的感受
[00:45.84]在这寂寥无人的深夜里
[00:49.99]默默细数伤心
[00:53.44]要知道她多么的爱你
[01:01.11]时间终不会停留
[01:04.44]谁都不能回到从头
[01:08.69]那些伤痛的过往
[01:10.63]终将变成记忆的锁
[01:15.66]纷纷扰扰现实的世界里
[01:19.43]一份真情有多难得
[01:23.45]请珍惜这来之不易的拥有
[01:30.79]别把最疼爱你的人弄丢了
[01:34.39]别再让那爱你的心受伤了
[01:38.34]一定要记得她当初的选择
[01:42.12]希望的是值得
[01:45.76]别把最疼爱你的人弄丢了
[01:49.17]别再让那爱你的心总受伤了
[01:53.21]别让自己留下悔恨的以后
[02:00.11]演变成寂寞
[02:03.15]
[02:19.87]时间终不会停留
[02:23.09]谁都不能回到从头
[02:27.31]那些伤痛的过往终
[02:29.54]将变成记忆的锁
[02:34.50]纷纷扰扰现实的世界里
[02:38.15]一份真情有多难得
[02:42.13]请珍惜这来之不易的拥有
[02:49.47]别把最疼爱你的人弄丢了
[02:52.95]别再让那爱你的心受伤了
[02:57.02]一定要记得她当初的选择
[03:00.86]希望的是值得
[03:04.50]别把最疼爱你的人弄丢了
[03:07.85]别再让那爱你的心总受伤了
[03:11.96]别让自己留下悔恨的以后
[03:20.44]还能有什么
[03:23.04]能比这真爱真实执着
[03:26.94]别在一切无法挽回的时候
[03:30.66]你才懂了
[03:34.44]别把最疼爱你的人弄丢了
[03:38.01]别再让那爱你的心受伤了
[03:41.99]一定要记得她当初的选择
[03:45.88]希望的是值得
[03:49.43]别把最疼爱你的人弄丢了
[03:52.96]别再让那爱你的心总受伤了
[03:56.93]别让自己留下悔恨的以后
[04:04.76]演变成寂寞
[04:09.00]`
      },
      {
      id:7,
      posit:'http://www.liuhedong.online/music/7.jpg',
      name:'别怕我伤心',
      author:'张信哲',
      src:'http://www.liuhedong.online/music/7.mp3',
      des:'张信哲，1967年3月26日生于台湾，歌手、演员、舞台剧团团长。',
       lrc:`[ti:别怕我伤心 ]
[ar:张信哲]
[by:海之恋]
[t_time:(04:48)]
[00:00.00]歌名：别怕我伤心
[00:04.37]歌手：张信哲
[00:09.62]制作：许成山
[00:14.32]QQ:359049841
[02:35.00][00:19.67]好久没有你的信
[02:39.90][00:24.00]好久没有人陪我谈心
[02:44.00][00:27.80]怀念你柔情似水的眼睛
[02:47.40][00:31.15]是我天空最美丽的星星
[02:51.10][00:35.00]异乡的午夜特别冷清
[02:54.00][00:38.00]一个男人和一颗热切的心
[02:57.30][00:41.20]不知在远方的你是否能感应
[03:04.90][00:48.99]我从来不敢给你任何诺言
[03:07.90][00:52.90]是因为我知道我们太年轻
[03:11.99][00:55.99]你追求的是一种浪漫感觉
[03:15.80][00:59.90]还是那不必负责任的热情
[03:19.10][01:03.50]心中的话到现在才对你表明
[03:22.70][01:06.90]不知道你是否会因此而清醒
[03:26.20][01:10.80]让身在远方的我不必为你担心
[04:01.80][03:33.00][01:17.00]一颗爱你的心
[04:06.10][03:37.00][01:21.00]时时刻刻为你转不停
[04:09.20][03:40.80][01:25.50]我的爱也曾经
[04:12.80][03:44.50][01:28.70]深深温暖你的心灵
[04:16.20][03:47.20][01:31.90]你和他之间
[04:21.00][03:52.00][01:36.00]是否已经有了真感情
[04:24.20][03:55.10][01:39.20]别隐瞒 对我说
[04:27.40][03:58.40][01:42.00]别怕我伤心
[01:50.00]music
[02:00.00]歌名：别怕我伤心
[02:10.00]歌手：张信哲
[02:18.00]制作：许成山
[02:26.00]QQ:359049841
[04:35.00]The end`
      },
    ],
     musicText:''
  },

  playMusic:function(event){
    var idx = event.target.dataset.id;
    var that = this;
    that.setData({
      music: this.data.musicList[idx]
    })
    
   musicLrc = parseLyric(this.data.musicList[idx].lrc);
    setTimeout(function(){
       that.audioCtx.play();
    },500)
   

      
  },
  endHandle:function(){
    var that = this;
    var pos = 0;
    if(that.data.music.id>= that.data.musicList.length){
         pos = 0;
    }else{
      pos = that.data.music.id;
      
    }
    var playingMusic = that.data.musicList[pos];
    musicLrc = parseLyric(that.data.musicList[pos].lrc);
    that.setData({
      music:playingMusic
    })
    setTimeout(function(){
      that.audioCtx.play()
    },500)
  },



 
  audioPlay: function () {
    this.audioCtx.play()
  },
  audioPause: function () {
    this.audioCtx.pause()
  },
  audio14: function () {
    this.audioCtx.seek(150)
  },
  audioStart: function () {
    this.audioCtx.seek(0)
  },
  time:function(event){
    var that = this;
    
    var second = parseInt(event.detail.currentTime);
    
    var per = event.detail.currentTime / event.detail.duration;

    that.setData({
      percent:parseInt(per*100),
      musicText: musicLrc[second]
    })
  }
})